Revit 2027 API
BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsCorruption Property
 Unable to array this mixture of modeling and view specific elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArrayMixedModAndViewSpecElemsCorruption { get; }
Public Shared ReadOnly Property ArrayMixedModAndViewSpecElemsCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArrayMixedModAndViewSpecElemsCorruption {
	FailureDefinitionId^ get ();
}
static member ArrayMixedModAndViewSpecElemsCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace